In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
dataset = pd.read_csv('adult.csv')

In [4]:
dataset.shape

(32561, 15)

In [5]:
dataset.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

In [6]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education.num     32561 non-null int64
marital.status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital.gain      32561 non-null int64
capital.loss      32561 non-null int64
hours.per.week    32561 non-null int64
native.country    32561 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [7]:
dataset.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [8]:
pd.value_counts(dataset['workclass'])

Private             22696
Self-emp-not-inc     2541
Local-gov            2093
?                    1836
State-gov            1298
Self-emp-inc         1116
Federal-gov           960
Without-pay            14
Never-worked            7
Name: workclass, dtype: int64

In [9]:
dataset[dataset == '?'] = np.nan

In [10]:
pd.value_counts(dataset['workclass'])

Private             22696
Self-emp-not-inc     2541
Local-gov            2093
State-gov            1298
Self-emp-inc         1116
Federal-gov           960
Without-pay            14
Never-worked            7
Name: workclass, dtype: int64

In [11]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         30725 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education.num     32561 non-null int64
marital.status    32561 non-null object
occupation        30718 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital.gain      32561 non-null int64
capital.loss      32561 non-null int64
hours.per.week    32561 non-null int64
native.country    31978 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [12]:
dataset.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
income               0
dtype: int64

In [13]:
dataset['workclass'].fillna(dataset['workclass'].mode()[0], inplace=True)

In [14]:
dataset.isnull().sum()

age                  0
workclass            0
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
income               0
dtype: int64

In [15]:
dataset['occupation'].fillna(dataset['occupation'].mode()[0] , inplace = True)

In [16]:
dataset.isnull().sum()

age                 0
workclass           0
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation          0
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      0
native.country    583
income              0
dtype: int64

In [17]:
dataset['native.country'].fillna(dataset['native.country'].mode()[0] , inplace = True)

In [18]:
dataset.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [19]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()

category = ['workclass' , 'education' , 'marital.status' , 'occupation' , 'relationship' , 'race' , 'sex' , 'native.country']
for col in category:
    dataset[col] = label_encoder.fit_transform(dataset[col])

In [21]:
dataset.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,3,77053,11,9,6,9,1,4,0,0,4356,40,38,<=50K
1,82,3,132870,11,9,6,3,1,4,0,0,4356,18,38,<=50K
2,66,3,186061,15,10,6,9,4,2,0,0,4356,40,38,<=50K
3,54,3,140359,5,4,0,6,4,4,0,0,3900,40,38,<=50K
4,41,3,264663,15,10,5,9,3,4,0,0,3900,40,38,<=50K

In [20]:
x = dataset.drop(['income'] , axis = 1)

In [21]:
x.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country
0,90,3,77053,11,9,6,9,1,4,0,0,4356,40,38
1,82,3,132870,11,9,6,3,1,4,0,0,4356,18,38
2,66,3,186061,15,10,6,9,4,2,0,0,4356,40,38
3,54,3,140359,5,4,0,6,4,4,0,0,3900,40,38
4,41,3,264663,15,10,5,9,3,4,0,0,3900,40,38

In [22]:
x.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
dtype: int64

In [23]:
y = dataset['income']

In [24]:
y.head()

0    <=50K
1    <=50K
2    <=50K
3    <=50K
4    <=50K
Name: income, dtype: object

In [25]:
from sklearn.model_selection import train_test_split
x_train , x_test , y_train , y_test = train_test_split(x, y, test_size = 0.25 , random_state = 0)

In [26]:
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
x_train = sc_x.fit_transform(x_train)
x_test = sc_x.transform(x_test)

C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\preprocessing\data.py:617: DataConversionWarning: Data with input dtype int32, int64 were all converted to float64 by StandardScaler.
  return self.partial_fit(X, y)
C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\base.py:462: DataConversionWarning: Data with input dtype int32, int64 were all converted to float64 by StandardScaler.
  return self.fit(X, **fit_params).transform(X)
C:\Users\Lenovo\Anaconda3\lib\site-packages\ipykernel\__main__.py:4: DataConversionWarning: Data with input dtype int32, int64 were all converted to float64 by StandardScaler.

In [27]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()
model.fit(x_train , y_train)
#y_pred = model.predict(x_test)

C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='warn',
          n_jobs=None, penalty='l2', random_state=None, solver='warn',
          tol=0.0001, verbose=0, warm_start=False)

In [28]:
y_pred = model.predict(x_test)

In [29]:
from sklearn.metrics import accuracy_score
ac = accuracy_score(y_test , y_pred)

In [30]:
ac

0.8227490480284977

In [31]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test , y_pred)

In [32]:
cm

array([[5846,  347],
       [1096,  852]], dtype=int64)

In [33]:
from sklearn.decomposition import PCA
pca = PCA()
x_train = pca.fit_transform(x_train)
arr = pca.explained_variance_ratio_

In [34]:
arr

array([0.14787211, 0.10164799, 0.08140256, 0.07881498, 0.07458023,
       0.0728962 , 0.07009159, 0.0675686 , 0.06470317, 0.06135329,
       0.06075788, 0.04833067, 0.04264044, 0.02734028])

In [35]:
sum = 0
for a in arr[:13]:
    sum = sum + a

In [36]:
sum

0.97265971502276

In [37]:
dataset.iloc[: , :-2].head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week
0,90,3,77053,11,9,6,9,1,4,0,0,4356,40
1,82,3,132870,11,9,6,3,1,4,0,0,4356,18
2,66,3,186061,15,10,6,9,4,2,0,0,4356,40
3,54,3,140359,5,4,0,6,4,4,0,0,3900,40
4,41,3,264663,15,10,5,9,3,4,0,0,3900,40

In [38]:
x1 = dataset.drop(['income'] , axis = 1)
x1 = x1.drop(['native.country'] , axis = 1)
y1 = dataset['income']

In [39]:
y1.head()

0    <=50K
1    <=50K
2    <=50K
3    <=50K
4    <=50K
Name: income, dtype: object

In [40]:
x1.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week
0,90,3,77053,11,9,6,9,1,4,0,0,4356,40
1,82,3,132870,11,9,6,3,1,4,0,0,4356,18
2,66,3,186061,15,10,6,9,4,2,0,0,4356,40
3,54,3,140359,5,4,0,6,4,4,0,0,3900,40
4,41,3,264663,15,10,5,9,3,4,0,0,3900,40

In [41]:
x1_train , x1_test , y1_train , y1_test = train_test_split(x1 , y1 , test_size = 0.25 , random_state = 0)

In [42]:
from sklearn.preprocessing import StandardScaler
sc_1 = StandardScaler()
x1_train = sc_1.fit_transform(x_train)
x1_test =  sc_1.transform(x_test)

In [88]:
x1_test

array([[ 0.88677571, -0.07294587,  0.74837568, ..., -0.26570922,
        -0.05077438,  0.42357397],
       [-0.99724292, -0.07294587,  0.42033827, ..., -0.26570922,
        -1.62559715,  0.42357397],
       [-0.79356523, -0.07294587, -0.57178438, ..., -0.26570922,
        -0.57571531,  0.6901567 ],
       ...,
       [ 0.27574264, -0.07294587,  1.01469563, ..., -0.26570922,
         1.52404838,  0.42357397],
       [ 0.98861456,  1.42839258, -0.43289571, ..., -0.26570922,
         0.99910746,  0.42357397],
       [ 0.83585629, -0.07294587, -0.27749885, ...,  6.72174672,
         0.47416654,  0.42357397]])

In [89]:
model_1 = LogisticRegression()
model_1.fit(x1_train , y1_train)
y1_pred = model_1.predict(x1_test)

C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [44]:
y1_pred

array(['<=50K', '<=50K', '<=50K', ..., '>50K', '<=50K', '<=50K'],
      dtype=object)

In [45]:
from sklearn.metrics import accuracy_score
ac = accuracy_score(y1_pred , y1_test)

In [46]:
ac

0.6849281415059575

In [47]:
dataset.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,3,77053,11,9,6,9,1,4,0,0,4356,40,38,<=50K
1,82,3,132870,11,9,6,3,1,4,0,0,4356,18,38,<=50K
2,66,3,186061,15,10,6,9,4,2,0,0,4356,40,38,<=50K
3,54,3,140359,5,4,0,6,4,4,0,0,3900,40,38,<=50K
4,41,3,264663,15,10,5,9,3,4,0,0,3900,40,38,<=50K

In [48]:
x2 = dataset.drop(['fnlwgt'] , axis = 1)
x2 = x2.drop(['income'] , axis = 1)
x2 = x2.drop(['capital.loss'] , axis = 1)
y2 = dataset['income']

In [49]:
x2.head()

,age,workclass,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,hours.per.week,native.country
0,90,3,11,9,6,9,1,4,0,0,40,38
1,82,3,11,9,6,3,1,4,0,0,18,38
2,66,3,15,10,6,9,4,2,0,0,40,38
3,54,3,5,4,0,6,4,4,0,0,40,38
4,41,3,15,10,5,9,3,4,0,0,40,38

In [50]:
y2.head()

0    <=50K
1    <=50K
2    <=50K
3    <=50K
4    <=50K
Name: income, dtype: object

In [51]:
x2_train , x2_test , y2_train , y2_test = train_test_split(x2 , y2 , test_size = 0.25 , random_state = 0)

In [52]:
model2 = LogisticRegression()

In [53]:
model2.fit(x2_train , y2_train)
y2_pred = model2.predict(x2_test)

C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [54]:
from sklearn.metrics import accuracy_score
acc = accuracy_score(y2_test , y2_pred)
acc

0.8201695123449207

In [55]:
from sklearn.svm import SVC
svm = SVC()
svm.fit(x_train ,y_train)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape='ovr', degree=3, gamma='auto_deprecated',
  kernel='rbf', max_iter=-1, probability=False, random_state=None,
  shrinking=True, tol=0.001, verbose=False)

In [56]:
pred = svm.predict(x_test)
acc_s = accuracy_score(pred , y_test)
acc_s

0.7156368996437784

In [58]:
from sklearn.svm import SVC
svm_1 = SVC()

In [59]:
svm_1.fit(x1_train , y1_train)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape='ovr', degree=3, gamma='auto_deprecated',
  kernel='rbf', max_iter=-1, probability=False, random_state=None,
  shrinking=True, tol=0.001, verbose=False)

In [61]:
pred1 = svm_1.predict(x1_test)
acc_s1 = accuracy_score(pred1 , y1_test)
acc_s1

0.7201817958481759

In [62]:
from sklearn.tree import DecisionTreeClassifier
dt = DecisionTreeClassifier()
dt.fit(x_train , y_train)
pred_d2 = dt.predict(x_test)

In [63]:
from sklearn.metrics import accuracy_score
ac = accuracy_score(pred_d2 , y_test)
ac

0.7313597838103427

In [68]:
from sklearn.tree import DecisionTreeClassifier
dt1 = DecisionTreeClassifier()
dt1.fit(x2_train , y2_train)
pred_d = dt1.predict(x2_test)
ac = accuracy_score(pred_d , y2_test)
ac

0.8039552880481513

In [23]:
dataset.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,3,77053,11,9,6,9,1,4,0,0,4356,40,38,<=50K
1,82,3,132870,11,9,6,3,1,4,0,0,4356,18,38,<=50K
2,66,3,186061,15,10,6,9,4,2,0,0,4356,40,38,<=50K
3,54,3,140359,5,4,0,6,4,4,0,0,3900,40,38,<=50K
4,41,3,264663,15,10,5,9,3,4,0,0,3900,40,38,<=50K

In [26]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [27]:
xa = dataset.drop(['income'] , axis = 1)
ya = dataset['income']

xa_train , xa_test , ya_train , ya_test = train_test_split(xa , ya , test_size = 0.25 , random_state = 0)

In [28]:
xa_train.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country
26464,55,3,208019,4,3,2,6,0,4,1,0,0,40,25
16134,42,3,175526,11,9,2,6,0,4,1,0,0,40,38
4747,42,3,137390,11,9,2,9,0,4,1,0,0,40,38
8369,25,3,228608,15,10,4,2,2,1,0,0,0,40,0
5741,60,3,106850,0,6,0,6,1,4,0,0,0,40,38

In [41]:
xb = dataset.drop(['income'] , axis = 1)
yb = dataset['income']

xb_train , xb_test , yb_train , yb_test = train_test_split(xb , yb , test_size = 0.25 , random_state = 0)

from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
xb_train = sc.fit_transform(xb_train)
xb_test = sc.transform(xb_test)

C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\preprocessing\data.py:617: DataConversionWarning: Data with input dtype int32, int64 were all converted to float64 by StandardScaler.
  return self.partial_fit(X, y)
C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\base.py:462: DataConversionWarning: Data with input dtype int32, int64 were all converted to float64 by StandardScaler.
  return self.fit(X, **fit_params).transform(X)
C:\Users\Lenovo\Anaconda3\lib\site-packages\ipykernel\__main__.py:9: DataConversionWarning: Data with input dtype int32, int64 were all converted to float64 by StandardScaler.

In [43]:
xb_test

array([[ 1.27591266, -0.087019  ,  0.79891892, ..., -0.21856573,
        -0.03923011,  0.26205642],
       [-1.43485534, -0.087019  ,  0.44872677, ..., -0.21856573,
        -1.25599461,  0.26205642],
       [-1.14179934, -0.087019  , -0.61040113, ..., -0.21856573,
        -0.44481828,  0.42698562],
       ...,
       [ 0.39674466, -0.087019  ,  1.08322538, ..., -0.21856573,
         1.1775344 ,  0.26205642],
       [ 1.42244067,  1.70396632, -0.4621323 , ..., -0.21856573,
         0.77194623,  0.26205642],
       [ 1.20264866, -0.087019  , -0.29624036, ...,  5.52914003,
         0.36635806,  0.26205642]])

Logistic Regression

In [31]:
from sklearn.linear_model import LogisticRegression
lg_a =LogisticRegression()
lg_a.fit(xa_train , ya_train)
pred_a = lg_a.predict(xa_test)
from sklearn.metrics import accuracy_score 
acc_a = accuracy_score(pred_a , ya_test)
acc_a

C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

0.7975678663554846

In [32]:
from sklearn.linear_model import LogisticRegression
lg_b =LogisticRegression()
lg_b.fit(xb_train , yb_train)
pred_b = lg_b.predict(xb_test)
from sklearn.metrics import accuracy_score 
acc_b = accuracy_score(pred_b , yb_test)
acc_b

C:\Users\Lenovo\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

0.8227490480284977

SVM

In [ ]:
from sklearn.svm import SVC
svm_a = SVC(kernel = 'linear' , random_state = 0)
svm_a.fit(xa_train , ya_train)
pred_a = svm_a.predict(xa_test)
acc_a = accuracy_score(pred_a , ya_test)
acc_a

In [98]:
from sklearn.svm import SVC
svm_b = SVC(kernel = 'linear' , random_state = 0)
svm_b.fit(xb_train , yb_train)
pred_b = svm_b.predict(xb_test)
acc_b = accuracy_score(pred_b , yb_test)
acc_b

0.8457191991155878

RandomForrest

In [37]:
from sklearn.ensemble import RandomForestClassifier
rf_a = RandomForestClassifier(n_estimators = 20 , criterion = 'entropy' , random_state = 0)
rf_a.fit(xa_train , ya_train)
pred_a = rf_a.predict(xa_test)
acc_a = accuracy_score(pred_a , ya_test)
acc_a

0.8541948163616263

In [44]:
from sklearn.ensemble import RandomForestClassifier
rf_b = RandomForestClassifier(n_estimators = 20 , criterion = 'entropy' , random_state = 0)
rf_b.fit(xb_train , yb_train)
pred_b = rf_b.predict(xb_test)
acc_b = accuracy_score(pred_b , yb_test)
acc_b

0.8548089915243827